RudolphSikorskiy/STSW-WESU1/Drivers/BSP/Components/stc3115/stc3115_Driver_00.c
/**
  ******************************************************************************
  * @file    stc3115_Driver_00.c
  * @author  System Lab
  * @version V1.1.0
  * @date    25-November-2016
  * @brief   This file includes the driver for ST3115 Gas Gauge
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics International N.V. 
  * All rights reserved.</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stc3115_Driver.h" 
#include "stc3115_Battery.h"

/** @addtogroup BSP             BSP
 * @{
 */

/** @addtogroup COMPONENTS      COMPONENTS
 * @{
 */
 

/** @addtogroup STC3115         STC3115
  * @{
  */

/** @defgroup STC3115_Exported_Types            STC3115_Exported_Types
  * @{
  */
   
  RAMData_TypeDef RAMData;      //!< RAM registers structure

/**
  * @}
  */ 

/** @defgroup STC3115_Imported_Functions         STC3115_Imported_Functions
  * @{
  */
extern void BSP_GG_IO_Init(void);
extern int BSP_GG_IO_Write(uint8_t* pBuffer, uint8_t WriteAddr, uint16_t NumByteToWrite);
extern int BSP_GG_IO_Read(uint8_t* pBuffer, uint8_t RegisterAddr, uint16_t NumByteToRead);

/**
  * @}
  */


/** @defgroup STC3115_Driver_I2C_ReadWrite_Interface   STC3115_Driver_I2C_ReadWrite_Interface
  * @{
  */

/** 
 * @brief Utility function to read the value stored in one register
 * @param  RegAddress STC3115 register to read
 * @param  value pointer to integer where to store data
 * @retval Error code: 0 ok, -1 error
 */
static int STC3115_ReadByte(int RegAddress, int* value)
{
  int ret;
  uint8_t tmp;
  
  ret = BSP_GG_IO_Read(&tmp, RegAddress, 1);
  *value = tmp & 0xff;
  return ret;
}


/**
 * @brief utility function to write a 8-bit value into a register
 * @param RegAddress STC3115 register
 * @param value value to write
 * @retval Error code: 0 ok, -1 error
 */
static int STC3115_WriteByte(int RegAddress, int value)
{
	uint8_t tmp = value & 0xff;
	return BSP_GG_IO_Write(&tmp, RegAddress, 1);
}


/**
 * @brief Utility function to read the value stored in one register pair
 * @param RegAddress STC3115 register
 * @param value pointer to integer value where to store data
 * @retval Error code: 0 ok, -1 error
 */
static int STC3115_ReadWord(int RegAddress, int* value)
{
  int ret;
  uint16_t tmp;
  
  ret =  BSP_GG_IO_Read((uint8_t*)&tmp, RegAddress, 2);
  *value = tmp & 0xffff;
  return ret;
}


/**
 * @brief Utility function to write a 16-bit value into a register pair
 * @param RegAddress STC3115 register
 * @param value value to write
 * @retval Error code: 0 ok, -1 error
 */
static int STC3115_WriteWord(int RegAddress, int value)
{
  uint16_t tmp = value & 0xffff;
  
  return BSP_GG_IO_Write((uint8_t*)&tmp, RegAddress, 2);
}


/**
  * @}
  */ 



/** @defgroup STC3115_Driver_private_interface  STC3115_Driver_private_interface
  * @{
  */


/**
 * @brief Read the STC3115 status
 * @retval status word (REG_MODE / REG_CTRL), -1 if error
 */
static int STC3115_Status(void)
{
  int value;

  /* First, check the presence of the STC3115 by reading first byte of dev. ID */
  STC3115_ReadByte(STC3115_REG_ID, &value);
  if (value != STC3115_ID)
          return -1;

  /* read REG_MODE and REG_CTRL */
  STC3115_ReadWord(STC3115_REG_MODE, &value);
  value &= 0x7fff;   

  return value;
}


/**
 * @brief Initialize the STC3115 parameters
 * @param ConfigData Pointer to STC3115 Configuration Data structure
 * @retval None
 */
static void STC3115_SetParam(STC3115_ConfigData_TypeDef *ConfigData)
{
	int value;

	/* set GG_RUN=0 before changing algo parameters */
	STC3115_WriteByte(STC3115_REG_MODE,STC3115_VMODE);

	/* init OCV curve */
	BSP_GG_IO_Write((unsigned char *) ConfigData->OCVOffset, STC3115_REG_OCVTAB, OCVTAB_SIZE);

	/* set alm level if different from default */
	if (ConfigData->Alm_SOC !=0 )   
		STC3115_WriteByte(STC3115_REG_ALARM_SOC, ConfigData->Alm_SOC*2); 
	if (ConfigData->Alm_Vbat !=0 ){
		value= ((long)(ConfigData->Alm_Vbat << 9) / VoltageFactor); /* LSB=8*2.2mV */
		STC3115_WriteByte(STC3115_REG_ALARM_VOLTAGE, value);
	}

