RudolphSikorskiy/STSW-WESU1/Drivers/BSP/Components/stc3115/stc3115_Driver_00.c
	/* relaxation timer */
	if (ConfigData->Rsense !=0 ){
		value= ((long)(ConfigData->RelaxCurrent << 9) / (CurrentFactor / ConfigData->Rsense));   /* LSB=8*5.88uV */
		STC3115_WriteByte(STC3115_REG_CURRENT_THRES,value); 
	}

	/* set parameters if different from default, only if a restart is done (battery change) */
	if (RAMData.reg.CC_cnf !=0 ) STC3115_WriteWord(STC3115_REG_CC_CNF,RAMData.reg.CC_cnf); 
	if (RAMData.reg.VM_cnf !=0 ) STC3115_WriteWord(STC3115_REG_VM_CNF,RAMData.reg.VM_cnf); 

	STC3115_WriteByte(STC3115_REG_CTRL,0x03);  /*   clear PORDET, BATFAIL, free ALM pin, reset conv counter */
	STC3115_WriteByte(STC3115_REG_MODE, STC3115_GG_RUN | (STC3115_VMODE * ConfigData->Vmode) | (STC3115_ALM_ENA * ALM_EN));  /*   set GG_RUN=1, set mode, set alm enable */

	return;
}  


/**
 * @brief Initialize and start the STC3115 at application startup
 * @param :ConfigData Pointer to STC3115 Configuration Data structure 
 * @retval 0 if ok, -1 if error
 */
static int STC3115_Startup(STC3115_ConfigData_TypeDef *ConfigData)
{
	int res;
	int ocv;

	/* check STC310x status */
	res = STC3115_Status();
	if (res<0) return(res);

	/* read OCV */
	STC3115_ReadWord(STC3115_REG_OCV, &ocv);

	STC3115_SetParam(ConfigData);  /* set STC3115 parameters  */

	/* rewrite ocv to start SOC with updated OCV curve */
	STC3115_WriteWord(STC3115_REG_OCV, ocv);

	return 0;
}


/**
 * @brief Restore STC3115 state
* @param :ConfigData Pointer to STC3115 Configuration Data structure
 * @retval Always 0
 */
static int STC3115_Restore(STC3115_ConfigData_TypeDef *ConfigData)
{
	int res;

	/* check STC310x status */
	res = STC3115_Status();
	if (res<0) return(res);

	STC3115_SetParam(ConfigData);  /* set STC3115 parameters  */

	/* restore SOC from RAM data */
	STC3115_WriteWord(STC3115_REG_SOC, RAMData.reg.HRSOC);

	return(0);
}


/**
 * @brief Stop the STC3115 at application power down
 * @retval Ok if success, error code otherwise
 */
static int STC3115_Powerdown(void)
{
	int res;

	/* write 0x01 into the REG_CTRL to release IO0 pin open, */
	STC3115_WriteByte(STC3115_REG_CTRL, 0x01);

	/* write 0 into the REG_MODE register to put the STC3115 in standby mode */
	res = STC3115_WriteByte(STC3115_REG_MODE, 0);
	if (res!= OK) return (res);

	return (OK);
}


/**
 * @brief Convert a raw 16-bit value from STC3115 registers into user units (mA, mAh, mV, °C)
 * @param value 
 * @param factor 
 * @retval Converted value (result = value * factor / 4096)
 */
static int STC3115_conv(short value, unsigned short factor)
{
	int v;

	v = ( (long) value * factor ) >> 11;
	v = (v+1)/2;

	return (v);
}


/**
 * @brief Utility function to read the battery data from STC3115 to be called every 5s or so
* @param :BatteryData Pointer to STC3115_BatteryData_TypeDef structure
 * @retval error status (OK, !OK)
 */
static int STC3115_ReadBatteryData(STC3115_BatteryData_TypeDef *BatteryData)
{
	unsigned char data[16];
	int res;
	int value;


	/* read STC3115 registers 0 to 14 */
	res = BSP_GG_IO_Read(data, 0, 15);

	if (res<0) return(res);  /* read failed */

	/* fill the battery status data */
	/* SOC */
	value=data[3]; value = (value<<8) + data[2];
	BatteryData->HRSOC = value;     /* result in 1/512% */
	BatteryData->SOC = (value * 10 + 256) / 512; /* result in 0.1% */

	/* conversion counter */
	value=data[5]; value = (value<<8) + data[4];
	BatteryData->ConvCounter = value;

	/* current */
	value=data[7]; value = (value<<8) + data[6];
	value &= 0x3fff;   /* mask unused bits */
	if (value>=0x2000) value = value - 0x4000;  /* convert to signed value */
	BatteryData->Current = STC3115_conv(value, CurrentFactor/RSENSE);  /* result in mA */

	/* voltage */
	value=data[9]; value = (value<<8) + data[8];
	value &= 0x0fff; /* mask unused bits */
	if (value>=0x0800) value -= 0x1000;  /* convert to signed value */
	value = STC3115_conv(value,VoltageFactor);  /* result in mV */
	BatteryData->Voltage = value;  /* result in mV */

	/* temperature */
	value=data[10]; 
	if (value>=0x80) value -= 0x100;  /* convert to signed value */
	BatteryData->Temperature = value*10;  /* result in 0.1°C */

	/* OCV */
	value=data[14]; value = (value<<8) + data[13];
	value &= 0x3fff; /* mask unused bits */
	if (value>=0x02000) value -= 0x4000;  /* convert to signed value */
	value = STC3115_conv(value,VoltageFactor);  
	value = (value+2) / 4;  /* divide by 4 with rounding */
	BatteryData->OCV = value;  /* result in mV */

	return(OK);
}

/**
  * @}
  */


/** @defgroup STC3115_Driver_RAM_memory_functions       STC3115_Driver_RAM_memory_functions
  * @{
  */


/**
 * @brief utility function to read the RAM data from STC3115
 * @param RamData Pointer to store STC3115 RAM data array to
 * @retval I2C error code
 */
static int STC3115_ReadRamData(unsigned char *RamData)
{
	return BSP_GG_IO_Read(RamData, STC3115_REG_RAM, RAM_SIZE);
}


/**
 * @brief Utility function to write the RAM data into STC3115
 * @param RamData Pointer to read STC3115 RAM data array from
 * @retval I2C error code
 */
static int STC3115_WriteRamData(unsigned char *RamData)
{
	return BSP_GG_IO_Write(RamData, STC3115_REG_RAM, RAM_SIZE);
}


/**
 * @brief Calculate the CRC8
 * @param *data : pointer to byte array, 
 * @param n     : number of bytes
 * @retval CRC value
 */
static int STC3115_CalcRamCRC8(unsigned char *data, int n)
{
	int crc=0;   /* initial value */
	int i, j;

	for (i=0;i<n;i++){
		crc ^= data[i];
		for (j=0;j<8;j++){
			crc <<= 1;
			if (crc & 0x100)  crc ^= 7;
		}
	}
	return(crc & 255);
}

 
/**
 * @brief calculate the RAM CRC
 * @retval CRC value
 */
static int STC3115_UpdateRamCRC(void)
{
	int res;

	res = STC3115_CalcRamCRC8(RAMData.db,RAM_SIZE-1);
	RAMData.db[RAM_SIZE-1] = res;   /* last byte holds the CRC */
	return(res);
}


/**
 * @brief Initialize the STC3115 RAM registers with valid test word and CRC
 * @param ConfigData Pointer to STC3115_ConfigData_TypeDef structure
 * @retval None
 */
static void STC3115_InitRamData(STC3115_ConfigData_TypeDef *ConfigData)
{
  int index;
  //Set full RAM tab to 0
  for (index=0;index<RAM_SIZE;index++) 
          RAMData.db[index]=0;
  //Fill RAM regs
  RAMData.reg.TstWord=RAM_TSTWORD;  /* Fixed word to check RAM integrity */
  RAMData.reg.CC_cnf = ConfigData->CC_cnf;
  RAMData.reg.VM_cnf = ConfigData->VM_cnf;
  /* update the crc */
  STC3115_UpdateRamCRC();
}

/**
  * @}
  */


/** @defgroup STC3115_Driver_interface_functions        STC3115_Driver_interface_functions
 * @{
 */


/**
 * @brief Start the STC3115 battery tracking algorithm system
 * @param ConfigData Pointer to STC3115_ConfigData_TypeDef structure
 * @param BatteryData Pointer to STC3115_BatteryData_TypeDef structure
 * @retval 0 is ok, -1 if STC310x not found or I2C error
 * @note Global STC310x data and gas gauge variables are affected
 */
int GasGauge_Initialization(STC3115_ConfigData_TypeDef *ConfigData, STC3115_BatteryData_TypeDef *BatteryData)
{
	int res,loop;
	int OCVOffset[16] = OCV_OFFSET_TAB;

	/*** Fill configuration structure parameters ***/

	ConfigData->Vmode = VMODE;

	if(RSENSE!=0)	ConfigData->Rsense = RSENSE;
	else ConfigData->Rsense = 10; // default value to avoid division by 0

	ConfigData->CC_cnf = (CAPACITY * ConfigData->Rsense * 250 + 6194) / 12389;

	if(RINT!=0)	ConfigData->VM_cnf = (CAPACITY * RINT * 50 + 24444) / 48889;
	else ConfigData->VM_cnf = (CAPACITY * 200 * 50 + 24444) / 48889; // default value

