RudolphSikorskiy/STSW-WESU1/Drivers/BSP/Components/stc3115/stc3115_Driver_00.c
	for(loop=0;loop<16;loop++)
	{
          if(OCVOffset[loop] > 127) OCVOffset[loop] = 127;
          if(OCVOffset[loop] < -127) OCVOffset[loop] = -127;
          ConfigData->OCVOffset[loop] = OCVOffset[loop];
	}

	ConfigData->Cnom = CAPACITY; 
	ConfigData->RelaxCurrent = CAPACITY / 20;

	ConfigData->Alm_SOC = ALM_SOC;
	ConfigData->Alm_Vbat = ALM_VBAT;
	/* Initialize I2C. Note that if I2C is already initialized this has not effect*/
	BSP_GG_IO_Init();
	/*** Initialize Gas Gauge system ***/
	/*Battery presence status init*/
	BatteryData->Presence = 1;

        /* Clear TstWord before read */
	RAMData.reg.TstWord = 0;
        
        /* check RAM data validity */
	STC3115_ReadRamData(RAMData.db);
 
	if ( (RAMData.reg.TstWord != RAM_TSTWORD) || (STC3115_CalcRamCRC8(RAMData.db,RAM_SIZE)!=0) )
          {
            /* RAM invalid */
            STC3115_InitRamData(ConfigData);
            res=STC3115_Startup(ConfigData);  /* return -1 if I2C error or STC3115 not present */
          }
	else
          {
            /* check STC3115 status */
            STC3115_ReadByte(STC3115_REG_CTRL, &res);
          if ( (res & (STC3115_BATFAIL | STC3115_PORDET)) != 0 )
            {
              res=STC3115_Startup(ConfigData);  /* return -1 if I2C error or STC3115 not present */
            }
		
          else
            {
              res=STC3115_Restore(ConfigData); /* recover from last SOC */
            }
          }

	//Update RAM status
	RAMData.reg.STC3115_Status = STC3115_INIT;
	STC3115_UpdateRamCRC();
	STC3115_WriteRamData(RAMData.db);

	return(res);    /* return -1 if I2C error or STC3115 not present */
}


/**
 * @brief Reset the Gas Gauge system
 * @retval 0 is ok, -1 if I2C error
 */
int GasGauge_Reset(void) 
{
	int res;
	
	/* reset RAM */
	RAMData.reg.TstWord=0;  
	RAMData.reg.STC3115_Status = 0;
	res = STC3115_WriteRamData(RAMData.db);
	if(res != OK) return res;
	/* reset STC3115*/
	res = STC3115_WriteByte(STC3115_REG_CTRL, STC3115_PORDET);  /*   set soft POR */

	return res;
}


/**
 * @brief Put the Gas Gauge in Power saving mode
 * @retval 0 is ok, -1 if I2C error
 */
int GasGauge_PowerSavingMode(void)
{
  return STC3115_SetPowerSavingMode();
}

/**
 * @brief Stop the Gas Gauge system
 * @retval 0 is ok, -1 if I2C error
 */
int GasGauge_Stop(void)
{
	int res;

	/*Save context in RAM*/
	STC3115_ReadRamData(RAMData.db);
	RAMData.reg.STC3115_Status= STC3115_POWERDN;
	/* update the crc */
	STC3115_UpdateRamCRC();
	STC3115_WriteRamData(RAMData.db);
	 
	/*STC3115 Power down*/
	res=STC3115_Powerdown();
	if (res!=0) return (-1);  /* error */

	return(0);  
}


/**
 * @brief Periodic Gas Gauge task, to be called e.g. every 5 sec.
 * @param ConfigData Pointer to STC3115_ConfigData_TypeDef structure
 * @param BatteryData Pointer to STC3115_BatteryData_TypeDef structure
 * @retval 1 if data available, 0 si no data, -1 if error
 * @note Affects global STC310x data and gas gauge variables
 */
int GasGauge_Task(STC3115_ConfigData_TypeDef *ConfigData,STC3115_BatteryData_TypeDef *BatteryData)
{
	int res;

	/* ----------------------------- System state verification ---------------------------- */
	/*Read STC3115 status registers */
	res=STC3115_Status();

	if (res<0) return(res);         /* return if I2C error or STC3115 not responding */  
	BatteryData->status = res;

	/* check STC3115 RAM status (battery has not been changed) */
	STC3115_ReadRamData(RAMData.db);
	if ( (RAMData.reg.TstWord!= RAM_TSTWORD) || (STC3115_CalcRamCRC8(RAMData.db,RAM_SIZE)!=0) )
        {
          /* if RAM non ok, reset it and set init state */
          STC3115_InitRamData(ConfigData); 
          RAMData.reg.STC3115_Status = STC3115_INIT;
	}

	/* check battery presence status */
	if ((BatteryData->status & (STC3115_BATFAIL<<8)) != 0)
        {
          /*Battery disconnection has been detected			*/
                  
          /*BATD pin level is over 1.61 or Vcc is below 2.7V	*/
          BatteryData->Presence = 0;

          /*HW and SW state machine reset*/
          GasGauge_Reset();

          return (-1);
	}

	/* check STC3115 running mode*/
	if ((BatteryData->status & STC3115_GG_RUN) == 0)
        {
            if((RAMData.reg.STC3115_Status == STC3115_RUNNING) || (RAMData.reg.STC3115_Status == STC3115_POWERDN))
                    STC3115_Restore(ConfigData);  /* if RUNNING state, restore STC3115*/
            else
            {
                    STC3115_Startup(ConfigData);  /* if INIT state, initialize STC3115*/
            }
            
            RAMData.reg.STC3115_Status = STC3115_INIT;
	}

	/* --------------------------------- Read battery data ------------------------------- */

	res = STC3115_ReadBatteryData(BatteryData);  
	if (res!=0) return(-1); /* abort in case of I2C failure */


	/* ------------------------------- battery data report ------------------------------- */
	/* check INIT state */
	if (RAMData.reg.STC3115_Status == STC3115_INIT)
        {
          /* INIT state, wait for current & temperature value available: */
          if (BatteryData->ConvCounter>VCOUNT)
          {
              RAMData.reg.STC3115_Status = STC3115_RUNNING;
              /*Battery is connected*/
              BatteryData->Presence = 1;
          }
	}

	if (RAMData.reg.STC3115_Status != STC3115_RUNNING) { /* not running : data partially availalble*/
		BatteryData->ChargeValue = ConfigData->Cnom * BatteryData->SOC / MAX_SOC;
		BatteryData->Current=0;
		BatteryData->Temperature=250;
		BatteryData->RemTime = -1;
	}
	else /*STC3115 running */
	{
  
		/* ---------- process SW algorithms -------- */
			
		/*early empty compensation*/
		if (BatteryData->Voltage<APP_CUTOFF_VOLTAGE)
			BatteryData->SOC = 0;
		else if (BatteryData->Voltage<(APP_CUTOFF_VOLTAGE+200))
			BatteryData->SOC = BatteryData->SOC * (BatteryData->Voltage - APP_CUTOFF_VOLTAGE) / 200;   

		/* Battery charge value calculation */

		BatteryData->ChargeValue = ConfigData->Cnom * BatteryData->SOC / MAX_SOC;

		if ((BatteryData->status & STC3115_VMODE) == 0) /* mixed mode only*/
		{  
			
			/*Lately fully compensation*/
			if ((BatteryData->status & STC3115_VMODE) == 0) /*running in mixed mode*/
			{ 
				
