RudolphSikorskiy/STSW-WESU1/Drivers/BSP/Components/stc3115/stc3115_Driver_00.c
				if(BatteryData->Current > APP_EOC_CURRENT && BatteryData->SOC > 990)
				{
					BatteryData->SOC = 990;
					STC3115_WriteWord(STC3115_REG_SOC,50688);   /* 99% */
				}
			}
			
			/*Remaining time calculation*/
			if(BatteryData->Current < 0)
			{

				BatteryData->RemTime = (BatteryData->RemTime * 4 + BatteryData->ChargeValue / BatteryData->Current * 60 ) / 5;
				if( BatteryData->RemTime  < 0)
					BatteryData->RemTime = -1; /* means no estimated time available */
			}
			else
				BatteryData->RemTime = -1; /* means no estimated time available */
			
		}
		else /* voltage mode only */
		{
			BatteryData->Current=0;
			BatteryData->RemTime = -1;
		}
		
		//SOC min/max clamping
		if(BatteryData->SOC>1000) BatteryData->SOC = MAX_SOC;
		if(BatteryData->SOC<0) BatteryData->SOC = 0;

	}
	/* save SOC */
	RAMData.reg.HRSOC = BatteryData->HRSOC;
	RAMData.reg.SOC = (BatteryData->SOC+5)/10;
	STC3115_UpdateRamCRC();
	STC3115_WriteRamData(RAMData.db);

	if (RAMData.reg.STC3115_Status==STC3115_RUNNING)
		return(1);
	else
		return(0);  /* only SOC, OCV and voltage are valid */
}


/**
 * @brief Set the power saving mode
 * @retval error status (OK, !OK)
 */
int STC3115_SetPowerSavingMode(void)
{
	int res;

	/* Read the mode register*/
	STC3115_ReadByte(STC3115_REG_MODE, &res);

	/* Set the VMODE bit to 1 */
	STC3115_WriteByte(STC3115_REG_MODE, (res | STC3115_VMODE));

	return (OK);
}


/**
 * @brief Stop the power saving mode
 * @retval Error status (OK, !OK)
 */
int STC3115_StopPowerSavingMode(void)
{
	int res;

	/* Read the mode register*/
	STC3115_ReadByte(STC3115_REG_MODE, &res);
	/*STC3115 is in power saving mode by default, cannot be set dynamically in mixed mode.		*/
	/*Change stc3115_Driver.h VMODE parameter, and connect an external sense resistor to STC3115	*/
	if (VMODE != MIXED_MODE) 
		return (!OK); 

	/* Set the VMODE bit to 0 */
	STC3115_WriteByte(STC3115_REG_MODE, (res & ~STC3115_VMODE));

	return (OK);
}


/**
 * @brief Enable alarm functionality
 * @retval error status (OK, !OK)
 */
int STC3115_AlarmSet(void)
{
	int res;

	/* Read the mode register*/
	STC3115_ReadByte(STC3115_REG_MODE, &res);

	/* Set the ALM_ENA bit to 1 */
	STC3115_WriteByte(STC3115_REG_MODE, (res | STC3115_ALM_ENA));
	
	return (OK);
}


/**
 * @brief Stop alarm functionality
 * @retval error status (OK, !OK)
 */
int STC3115_AlarmStop(void)
{
	int res;

	/* Read the mode register*/
	STC3115_ReadByte(STC3115_REG_MODE, &res);

	/* Set the ALM_ENA bit to 0 */
	res = STC3115_WriteByte(STC3115_REG_MODE, (res & ~STC3115_ALM_ENA));

	return (OK);
}


/**
 * @brief Return the ALM status
 * @retval ALM status 00 : no alarm
 *                    01 : SOC alarm
 *                    10 : Voltage alarm
 *                    11 : SOC and voltage alarm
 */
int STC3115_AlarmGet(void)
{
	int res;

	/* Read the mode register*/
	res = STC3115_ReadByte(STC3115_REG_CTRL, &res);
	res = res >> 5;

	return (res & 0x3);
}


/**
 * @brief Clear the alarm signal
 * @retval error status (OK, !OK)
 */
int STC3115_AlarmClear(void)
{
	int res;

	/* clear ALM bits*/
	res = STC3115_WriteByte(STC3115_REG_CTRL, 0x01);
	if (res!= OK) return (res);

	return (res);
}


/**
 * @brief Set the voltage alarm threshold
 * @param ConfigData Pointer to STC3115_ConfigData_TypeDef structure
 * @param VoltThresh Voltage alarm threshold
 * @retval error status (OK, !OK)
 */
int STC3115_AlarmSetVoltageThreshold(STC3115_ConfigData_TypeDef *ConfigData, int VoltThresh)
{
	int res;
	int value;

	ConfigData->Alm_Vbat = VoltThresh;
		
	value= ((long)(ConfigData->Alm_Vbat << 9) / VoltageFactor); /* LSB=8*2.2mV */
	res = STC3115_WriteByte(STC3115_REG_ALARM_VOLTAGE, value);
	if (res!= OK) return (res);

	return (OK);
}


/**
 * @brief Set the State of Charge alarm threshold
 * @param ConfigData Pointer to STC3115_ConfigData_TypeDef structure
 * @param SOCThresh SoC alarm threshold
 * @retval error status (OK, !OK)
 */
int STC3115_AlarmSetSOCThreshold(STC3115_ConfigData_TypeDef *ConfigData, int SOCThresh)
{
	int res;

	ConfigData->Alm_SOC = SOCThresh;
	res = STC3115_WriteByte(STC3115_REG_ALARM_SOC, ConfigData->Alm_SOC*2);
	if (res!= OK) return (res);

	return (OK);
}

/**
  * @}
  */

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */

/******************* (C) COPYRIGHT 2014 STMicroelectronics *****END OF FILE****/
